import engine.game as g


class Creature(object):
    def __init__(self):
        attr = {
            '姓名': '',
            '身份': '',  # '主角'/''
            '称呼': {
                '系统称呼': '',
                '自称': '',  # 我/在下/本大小姐/本人/[姓名]
                '尊称': '',  # 他人对自己的尊称
                '蔑称': '',  # 他人对自己的蔑称
            },
            '性别': '',  # '男性'/'女性'/'扶她'/''
            '等级': 1,
            '状态': {
                '体力': 100,  # 0代表死亡
                '耐力': 100,  # 0代表脱力
                '精力': 100,  # 0代表昏厥
                '存款': 0,
                '经验值': 0,
            },
            '属性': {
                '身高': 160,
                '体重': 50,
                '胸围': 50,
                '腰围': 50,
                '臀围': 50,
                '力量': 0,
                '敏捷': 0,
                '智力': 0,
                '体力上限': 100,  # 80 + (等级-1)*20
                '耐力上限': 100,  # 80 + (等级-1)*20
                '精力上限': 100,  # 80 + (等级-1)*20
                '经验值上限': 100,  # 80 + (等级-1)*20
            },
            '特征': {
                '体型': '',
                '职业': [],
                '种族': [],
            },
            '经验': {},
            '物品': [],
            '装备': {
                '头部': '',
                '面部': '',
                '颈部': '',
                '上身': '',
                '左手': '',
                '右手': '',
                '双手': '',
                '手指': [],
                '下身': '',
                '脚部': '',
            },
            '服装': {
                '帽子': '',
                '面具': '',
                '项链': '',
                '内衣': '',
                '外衣': '',
                '手镯': '',
                '戒指': '',
                '手套': '',
                '内裤': '',
                '裤子': '',
                '袜子': '',
                '鞋子': '',
            },
            '关系': {  # Hash
                '父亲': '',
                '母亲': '',
                '子女': [],
                '恋人': [],
                '爱人': [],
            },
            '宝珠': [],
            '能力': [],  # 顺从 欲望 技巧 感觉 S属性 （10级）
            '刻印': [],  # 苦痛 快乐 屈服 反发 淫纹 （5级）
            '性格': [],
            '体质': [],  # 先天的、自然性、生物性的的Tag
            '技能': [],
            '魔法': [],
            '后天': [],  # 后天的、社会性的的Tag
            'hash': g.get_hash(),
        }
        for key in attr:
            setattr(self, key, attr[key])
